var articles = [
    {
        id: 1,
        title: "فوائد التكنولجيا",
        desc: "اصبح العالم يتطور بشكل هائل ,بوجود التكنولجيا والتطورات المستمرةبة",
        info: " تساعد التكنولوجيا في تحسين جودة الحياة. فهي تجعل الحياة أكثر سهولة وراحة وأماناً. على سبيل المثال، يمكن الآن القيام بعمليات مالية وتسوق والتواصل مع الآخرين من أي مكان في العالم، وذلك بفضل التكنولوجيا. كما أنها تساعد في تطوير المنتجات والخدمات الجديدة التي تحسن الحياة اليومية للناس",
        img: "assets/img/tech.jpg",
        date: '20-06-2023',
        read: 10110,
        link: "read.html?id=1"
    },
    {
        id: 2,
        title: "فوائد التغذية",
        desc: "الطعام الصحي يقوي ويساعد الجسم على التغلب على الأمراض",
        info: "تخليص الجسم من السموم ومنح الجلد النضارة. تعزيز مستويات الطاقة، ورفع معدل إنتاج خلايا الدم والعضلات. التقليل من معدل الجفاف في جسم الإنسان. تنظيم درجة حرارة جسم الإنسان؛ مما يساعد على الشعور بالنشاط والحيوية طوال الوقت",
        img: "assets/img/download.jpg",
        date: '20-06-2023',
        read: 200,
        link: "read.html?id=2"

    },
    {
        id: 3,
        title: "السياحة في العالم",
        desc: "تمكن من استكشاف أماكن جديدة والتعرف على ثقافات مختلفة ",
        info: " تلعب السياحة دوراً حيوياً في تعزيز الصورة الإيجابية للدولة على المستوى الدولي. من خلال استقبال الزوار من مختلف أنحاء العالم، تتمكن الدولة من تقديم نفسها كوجهة جذابة ومضيافة، مما يعزز مكانتها ويجعلها أكثر شهرة واحتراماً في المجتمع الدولي. فوائد السياحة للدولة تشمل أيضاً تعزيز التفاهم بين الشعوب من خلال تبادل الثقافات",
        img: "assets/img/download (3).jpg",
        date: '20-06-2023',
        read: 12250,
        link: "read.html?id=3"


    },
    {
        id: 4,
        title: "فوائد الرياضة",
        desc: "تستعد على تنشيط الجسم وتقويته ليقوم بمهامه",
        info: "تساعد ممارسة الأنشطة البدنية بانتظام في تقوية عضلاتك وتعزيز قدرتك على التحمل. تساعد التمارين على إيصال الأكسجين والعناصر المغذية إلى أنسجة الجسم وتساعد الجهاز القلبي الوعائي على أداء وظائفه بكفاءة أكبر. وحين تتحسن صحة القلب والرئتين، يصبح لديك المزيد من الطاقة لأداء المهام اليومية.",
        img: "assets/img/download (4).jpg",
        date: '20-06-2023',
        read: 2511,
        link: "read.html?id=4"

    },
    {
        id: 5,
        title: "تعلم البرمجة",
        desc: "يقوي قدرات العقل ويوسع المدركات",
        info: "تساعد البرمجة في تطوير وابتكار الكثير من الحلول، وتحسين الكفاءة في العديد من العمليات. يوفر تعلم البرمجة الكثير من فرص العمل في مجالات مختلفة مثل تطوير البرامج، وتحليل البيانات، تطوير الألعاب، وغيرها.سواء في الشركات، أو المواقع، أو سوق العمل الحر",
        img: "assets/img/barmaje.jpg",
        date: '20-06-2023',
        read: 300,
        link: "read.html?id=5"

    },
    {
        id: 6,
        title: "التواصل مع الذات",
        desc: "يحفز ويساعد في تحسين الأداء والقيام بلمهام والوظائف",
        info: "في عالمنا المعاصر سريع التغيُّر، تظهر أهمية مهارات التواصل الفعال بصورة لا يمكن تجاهلها. فهي ليست مجرد ميزة إضافية، بل هي الركيزة الأساسية التي تحقق التطور الذاتي والنجاح الدائم في حياتنا. إنها الرمز الذي يمتلئ بالتفاؤل والشغف، حيث تعطينا القوة للتأثير على الآخرين وتحقيق أهدافنا الشخصية والمهنية."
                ,
        img: "assets/img/conect.jpg",
        date: '20-06-2023',
        read: 1300,
        link: "read.html?id=6"
    },
    {
        id: 7,
        title: "فنون الرسم",
        desc: "تحسين طرق التفكير لدى الشخص ويعزز قدرته على الإبداع والابتكار",
        info: "يقوي الذاكرة ويحسن قدرة الكتابة. ويقضي على الشعور المستمر بالخجل ويزيد من ثقة الفرد بنفسه و يعزز قدرة العقل على التواصل مع الآخرين دون الحاجة لاستخدام الكلام و يساعد في تحرير الطاقة السلبية التي تتراكم لدى المراهقين في هذه المرحلة العمرية",
        img: "assets/img/paint.jpg",
        date: '20-06-2023',
        read: 100,
        link: "read.html?id=7"
    },
    {
        id: 8,
        title: "فن اليوغا",
        desc: "تحافظ على تمثيل غذائي متوازن",
        info: " هي ممارسة شاملة توفر فوائد صحية للجسم والعقل، وتعتمد هذه الممارسة على تمارين التأمل والتنفس والحركة البطيئة والمرنة للجسم، كما تشمل فوائد ممارسة  تحسين اللياقة البدنية وتقوية العضلات والمرونة، وتحسين التوازن والتنسيق وتخفيف التوتر والقلق وتحسين جودة النوم والهضم."
                ,
        img: "assets/img/yoga.jpg",
        date: '20-06-2023',
        read: 10022,
        link: "read.html?id=8"
    },
];
// get top articles
var TopArticles = articles.slice(-3).reverse();
TopArticles.forEach(art => {
    var containerTop = document.getElementById("containerTop");
    var ContainerCard = document.createElement("div");

    ContainerCard.innerHTML = `
  <div class="article">
  <img src="${art.img}" alt="Article 2">
  <h3>${art.title}</h3>
  <p>${art.desc}.</p>
  <a href="${art.link}">اقرأ المزيد</a>
</div>
  `;
    containerTop.appendChild(ContainerCard)
});
// get most read
articles.sort(function (a, b) {
    return b.read - a.read
})
for (let i = 0; i < 3 && i < articles.length; i++) {
    var ContainerMostRead = document.getElementById("ContainerMostRead");
    var ConteinerArtMosr = document.createElement("div");
    ConteinerArtMosr.innerHTML = `
  <div class="article">
  <img src="${articles[i].img}" alt="Article 3">
  <h3>${articles[i].title}</h3>
  <p>${articles[i].desc}.</p>
  <a href="${articles[i].link}">اقرأ المزيد</a>
</div>
  `;
    ContainerMostRead.appendChild(ConteinerArtMosr)
}
